app/Models/SliderModel.php

SELECT *
FROM `slider`
---
    public function getSliderDetailes($slug = false){
        if($slug === false){
            return $this->findAll();